---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingLoopsOnBothSidesOfAxis
source: html/a8e78bda-10e2-8ccf-16cf-f2f6018ded47.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingLoopsOnBothSidesOfAxis Property

All curves must be on the same side of the axis.

## Syntax (C#)
```csharp
public static FailureDefinitionId SculptingLoopsOnBothSidesOfAxis { get; }
```